Case-ViewFactor-Ra90000-test3/constant/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


    right
    {
        type            lookup;
        emissivity      0.85;
    }

     left
    {
       type            lookup;
       emissivity      0.85;
    }

    hot
    {
      type            lookup;
      emissivity      0.85;
    }

    cold
    {
        type            lookup;
        emissivity      0.85;
    }




// ************************************************************************* //
