Case-ViewFactor-Ra90000-test3/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0     0    0)  
    (1     0    0)  
    (1     1    0)     
    (0     1    0)     
    (0     0    0.01)
    (1     0    0.01)
    (1     1    0.01)
    (0     1    0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 80 1) 
    simpleGrading (
    			( (0.5 0.5 8) (0.5 0.5 0.125) )
   			( (0.5 0.5 8) (0.5 0.5 0.125) ) 
    			1
    		  )
);

boundary
(
    cold
    {
        type wall;
        faces
        (
           (2 3 7 6)
        );
    }
     
     hot
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    right
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    left
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);

// ************************************************************************* //
